---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisResultSchema.IsValidObject
source: html/7b77ea01-4d54-08d4-66ec-2e6a2a39a2d2.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisResultSchema.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.